{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import yaml\n",
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "id_in_disease = set()\n",
    "\n",
    "is_first = True\n",
    "for line in open(\"to_neo4j/disease_drug.tsv\"):\n",
    "    if is_first:\n",
    "        is_first = False\n",
    "    else:\n",
    "        disease = line.strip().split(\"\\t\")[0]\n",
    "        id_in_disease.add(disease)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "410"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(id_in_disease)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "with open(\"config.yaml\", \"r\") as stream:\n",
    "    try:\n",
    "        PARAM = yaml.safe_load(stream)\n",
    "    except yaml.YAMLError as exc:\n",
    "        print(exc)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Depth 1: 7\n",
      "Depth 2: 38\n",
      "Depth 3: 164\n",
      "Depth 4: 509\n",
      "Depth 5: 859\n",
      "Depth 6: 719\n",
      "Depth 7: 406\n",
      "Depth 8: 181\n",
      "Depth 9: 63\n",
      "Depth 10: 19\n",
      "Depth 11: 12\n",
      "Depth 12: 8\n",
      "Depth 13: 3\n",
      "Depth 14: 0\n",
      "Depth 15: 0\n",
      "Depth 16: 0\n",
      "Depth 17: 0\n",
      "Depth 18: 0\n",
      "Depth 19: 0\n"
     ]
    }
   ],
   "source": [
    "driver = GraphDatabase.driver(PARAM[\"neo4j_url\"], auth=(PARAM[\"neo4j_username\"], PARAM[\"neo4j_password\"]))\n",
    "\n",
    "\n",
    "# Loop through results and do something with them\n",
    "for depth in range(1, 20):\n",
    "    query = f\"MATCH (:Condition {{name: 'Topical Descriptor'}})<-[:BELONGS_TO *{depth}]-(a:Condition) RETURN COUNT(a)\"\n",
    "    records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "    for record in records:\n",
    "        print (f\"Depth {depth}: {record['COUNT(a)']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = f\"MATCH (:Condition {{name: 'Topical Descriptor'}})<-[:BELONGS_TO *2]-(a:Condition) RETURN a\"\n",
    "records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "\n",
    "second_level = set()\n",
    "\n",
    "for record in records:\n",
    "    second_level.add(f\"{record['a']['name']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "source": [
    "taboo = []\n",
    "\n",
    "found = set()\n",
    "\n",
    "for s in second_level:\n",
    "    if s not in taboo:\n",
    "        query = f\"MATCH (:Condition {{name: '{s}'}})<-[:BELONGS_TO *]-(a:Condition) RETURN a\"\n",
    "\n",
    "        records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "        for record in records:\n",
    "            found.add(f\"{record['a']['id']}\")\n",
    "    \n",
    "print (len(id_in_disease - found))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "410"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(id_in_disease)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1114"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(found)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#taboo = []\n",
    "\n",
    "\n",
    "found = {}\n",
    "\n",
    "for s in second_level:\n",
    "\n",
    "    query = f\"MATCH (:Condition {{name: '{s}'}})<-[:BELONGS_TO *]-(a:Condition) RETURN COUNT(a)\"\n",
    "\n",
    "    records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "    for record in records:\n",
    "        found[s] = record['COUNT(a)']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Anesthesia and Analgesia': 3,\n",
       " 'Surgical Procedures, Operative': 3,\n",
       " 'Animal Diseases': 4,\n",
       " 'Viruses': 5,\n",
       " 'Health Services Administration': 10,\n",
       " 'Health Care Quality, Access, and Evaluation': 10,\n",
       " 'Psychological Phenomena': 13,\n",
       " 'Musculoskeletal and Neural Physiological Phenomena': 13,\n",
       " 'Behavioral Disciplines and Activities': 14,\n",
       " 'Investigative Techniques': 15,\n",
       " 'Physiological Phenomena': 16,\n",
       " 'Environment and Public Health': 18,\n",
       " 'Diagnosis': 18,\n",
       " 'Population Characteristics': 19,\n",
       " 'Chemically-Induced Disorders': 21,\n",
       " 'Behavior and Behavior Mechanisms': 22,\n",
       " 'Otorhinolaryngologic Diseases': 24,\n",
       " 'Natural Science Disciplines': 24,\n",
       " 'Wounds and Injuries': 26,\n",
       " 'Health Occupations': 30,\n",
       " 'Stomatognathic Diseases': 34,\n",
       " 'Endocrine System Diseases': 61,\n",
       " 'Eye Diseases': 61,\n",
       " 'Mental Disorders': 77,\n",
       " 'Musculoskeletal Diseases': 80,\n",
       " 'Immune System Diseases': 85,\n",
       " 'Respiratory Tract Diseases': 111,\n",
       " 'Cardiovascular Diseases': 118,\n",
       " 'Nutritional and Metabolic Diseases': 120,\n",
       " 'Skin and Connective Tissue Diseases': 128,\n",
       " 'Congenital, Hereditary, and Neonatal Diseases and Abnormalities': 131,\n",
       " 'Hemic and Lymphatic Diseases': 133,\n",
       " 'Digestive System Diseases': 138,\n",
       " 'Pathological Conditions, Signs and Symptoms': 189,\n",
       " 'Neoplasms': 231,\n",
       " 'Urogenital Diseases': 276,\n",
       " 'Nervous System Diseases': 296,\n",
       " 'Infections': 366}"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dict(sorted(found.items(), key=lambda item: item[1]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "taboo = [\"Investigative Techniques\", \"Diagnosis\", \"Animal Diseases\", \"Health Care Quality, Access, and Evaluation\", \"Health Services Administration\",\n",
    "         \"Psychological Phenomena\", \"Behavioral Disciplines and Activities\", \"Environment and Public Health\", \"Chemically-Induced Disorders\", \"Diagnosis\", \n",
    "         \"Population Characteristics\", \"Natural Science Disciplines\", \"Health Occupations\", \"Physiological Phenomena\"]\n",
    "#\n",
    "#taboo += [\"Anesthesia and Analgesia\", \"Viruses\", \"Surgical Procedures, Operative\",  \"Behavior and Behavior Mechanisms\", \"Otorhinolaryngologic Diseases\", \n",
    "#\"Wounds and Injuries\", \"Musculoskeletal and Neural Physiological Phenomena\", \"Stomatognathic Diseases\", \"Endocrine System Diseases\", \"Eye Diseases\"]\n",
    "\n",
    "\n",
    "found = set()\n",
    "\n",
    "for s in second_level:\n",
    "    if s not in taboo:\n",
    "        query = f\"MATCH (:Condition {{name: '{s}'}})<-[:BELONGS_TO *]-(a:Condition) RETURN a\"\n",
    "\n",
    "        records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "        for record in records:\n",
    "            found.add(f\"{record['a']['id']}\")\n",
    "\n",
    "print (len(taboo))\n",
    "print (len(id_in_disease - found))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "disease_categories = {}\n",
    "\n",
    "for s in second_level:\n",
    "    if s not in taboo:\n",
    "        query = f\"MATCH (:Condition {{name: '{s}'}})<-[:BELONGS_TO *]-(a:Condition) RETURN a\"\n",
    "\n",
    "        records, summary, keys = driver.execute_query(query, database_=\"neo4j\")\n",
    "        for record in records:\n",
    "            disease_id = record['a']['id']\n",
    "            if disease_id not in disease_categories:\n",
    "                disease_categories[disease_id] = set()\n",
    "            disease_categories[disease_id].add(s)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'D000038',\n",
       " 'D000086382',\n",
       " 'D000152',\n",
       " 'D000172',\n",
       " 'D000196',\n",
       " 'D000224',\n",
       " 'D000230',\n",
       " 'D000236',\n",
       " 'D000292',\n",
       " 'D000312',\n",
       " 'D000379',\n",
       " 'D000437',\n",
       " 'D000544',\n",
       " 'D000562',\n",
       " 'D000690',\n",
       " 'D000724',\n",
       " 'D000740',\n",
       " 'D000741',\n",
       " 'D000749',\n",
       " 'D000752',\n",
       " 'D000755',\n",
       " 'D000789',\n",
       " 'D000795',\n",
       " 'D000799',\n",
       " 'D000855',\n",
       " 'D001002',\n",
       " 'D001017',\n",
       " 'D001068',\n",
       " 'D001145',\n",
       " 'D001157',\n",
       " 'D001168',\n",
       " 'D001171',\n",
       " 'D001172',\n",
       " 'D001196',\n",
       " 'D001228',\n",
       " 'D001249',\n",
       " 'D001254',\n",
       " 'D001281',\n",
       " 'D001282',\n",
       " 'D001289',\n",
       " 'D001321',\n",
       " 'D001404',\n",
       " 'D001477',\n",
       " 'D001528',\n",
       " 'D001714',\n",
       " 'D001748',\n",
       " 'D001749',\n",
       " 'D001750',\n",
       " 'D001762',\n",
       " 'D001847',\n",
       " 'D001850',\n",
       " 'D001906',\n",
       " 'D001919',\n",
       " 'D001929',\n",
       " 'D001932',\n",
       " 'D001991',\n",
       " 'D002006',\n",
       " 'D002177',\n",
       " 'D002178',\n",
       " 'D002179',\n",
       " 'D002181',\n",
       " 'D002277',\n",
       " 'D002280',\n",
       " 'D002289',\n",
       " 'D002292',\n",
       " 'D002295',\n",
       " 'D002389',\n",
       " 'D002544',\n",
       " 'D002545',\n",
       " 'D002761',\n",
       " 'D002862',\n",
       " 'D003003',\n",
       " 'D003047',\n",
       " 'D003093',\n",
       " 'D003108',\n",
       " 'D003110',\n",
       " 'D003231',\n",
       " 'D003233',\n",
       " 'D003234',\n",
       " 'D003320',\n",
       " 'D003324',\n",
       " 'D003371',\n",
       " 'D003424',\n",
       " 'D003449',\n",
       " 'D003453',\n",
       " 'D003457',\n",
       " 'D003480',\n",
       " 'D003490',\n",
       " 'D003554',\n",
       " 'D003555',\n",
       " 'D003556',\n",
       " 'D003693',\n",
       " 'D003704',\n",
       " 'D003865',\n",
       " 'D003874',\n",
       " 'D003876',\n",
       " 'D003877',\n",
       " 'D003881',\n",
       " 'D003920',\n",
       " 'D003924',\n",
       " 'D003928',\n",
       " 'D003929',\n",
       " 'D004374',\n",
       " 'D004381',\n",
       " 'D004401',\n",
       " 'D004415',\n",
       " 'D004418',\n",
       " 'D004427',\n",
       " 'D004487',\n",
       " 'D004604',\n",
       " 'D004696',\n",
       " 'D004751',\n",
       " 'D004775',\n",
       " 'D004823',\n",
       " 'D004827',\n",
       " 'D004828',\n",
       " 'D004831',\n",
       " 'D004832',\n",
       " 'D004833',\n",
       " 'D004938',\n",
       " 'D004942',\n",
       " 'D005148',\n",
       " 'D005185',\n",
       " 'D005356',\n",
       " 'D005512',\n",
       " 'D005756',\n",
       " 'D005764',\n",
       " 'D005776',\n",
       " 'D005873',\n",
       " 'D005891',\n",
       " 'D005901',\n",
       " 'D005902',\n",
       " 'D006009',\n",
       " 'D006069',\n",
       " 'D006073',\n",
       " 'D006177',\n",
       " 'D006229',\n",
       " 'D006333',\n",
       " 'D006356',\n",
       " 'D006402',\n",
       " 'D006432',\n",
       " 'D006457',\n",
       " 'D006467',\n",
       " 'D006470',\n",
       " 'D006484',\n",
       " 'D006505',\n",
       " 'D006526',\n",
       " 'D006527',\n",
       " 'D006528',\n",
       " 'D006556',\n",
       " 'D006560',\n",
       " 'D006561',\n",
       " 'D006563',\n",
       " 'D006606',\n",
       " 'D006646',\n",
       " 'D006689',\n",
       " 'D006816',\n",
       " 'D006929',\n",
       " 'D006934',\n",
       " 'D006938',\n",
       " 'D006940',\n",
       " 'D006947',\n",
       " 'D006949',\n",
       " 'D006962',\n",
       " 'D006966',\n",
       " 'D006973',\n",
       " 'D006974',\n",
       " 'D006976',\n",
       " 'D007006',\n",
       " 'D007022',\n",
       " 'D007177',\n",
       " 'D007246',\n",
       " 'D007500',\n",
       " 'D007638',\n",
       " 'D007680',\n",
       " 'D007787',\n",
       " 'D007827',\n",
       " 'D007868',\n",
       " 'D007877',\n",
       " 'D007896',\n",
       " 'D007938',\n",
       " 'D008059',\n",
       " 'D008088',\n",
       " 'D008103',\n",
       " 'D008105',\n",
       " 'D008107',\n",
       " 'D008173',\n",
       " 'D008181',\n",
       " 'D008193',\n",
       " 'D008223',\n",
       " 'D008224',\n",
       " 'D008228',\n",
       " 'D008258',\n",
       " 'D008269',\n",
       " 'D008288',\n",
       " 'D008303',\n",
       " 'D008368',\n",
       " 'D008595',\n",
       " 'D008607',\n",
       " 'D008881',\n",
       " 'D009059',\n",
       " 'D009091',\n",
       " 'D009101',\n",
       " 'D009120',\n",
       " 'D009128',\n",
       " 'D009182',\n",
       " 'D009203',\n",
       " 'D009220',\n",
       " 'D009230',\n",
       " 'D009290',\n",
       " 'D009293',\n",
       " 'D009332',\n",
       " 'D009373',\n",
       " 'D009404',\n",
       " 'D009447',\n",
       " 'D009765',\n",
       " 'D009771',\n",
       " 'D009798',\n",
       " 'D009855',\n",
       " 'D009889',\n",
       " 'D009902',\n",
       " 'D010003',\n",
       " 'D010032',\n",
       " 'D010033',\n",
       " 'D010051',\n",
       " 'D010146',\n",
       " 'D010149',\n",
       " 'D010229',\n",
       " 'D010300',\n",
       " 'D010301',\n",
       " 'D010373',\n",
       " 'D010383',\n",
       " 'D010391',\n",
       " 'D010437',\n",
       " 'D010493',\n",
       " 'D010510',\n",
       " 'D010518',\n",
       " 'D010612',\n",
       " 'D010673',\n",
       " 'D010787',\n",
       " 'D010911',\n",
       " 'D010930',\n",
       " 'D011008',\n",
       " 'D011018',\n",
       " 'D011081',\n",
       " 'D011087',\n",
       " 'D011183',\n",
       " 'D011271',\n",
       " 'D011349',\n",
       " 'D011469',\n",
       " 'D011470',\n",
       " 'D011472',\n",
       " 'D011552',\n",
       " 'D011565',\n",
       " 'D011618',\n",
       " 'D011628',\n",
       " 'D011629',\n",
       " 'D011655',\n",
       " 'D011656',\n",
       " 'D011666',\n",
       " 'D011928',\n",
       " 'D012004',\n",
       " 'D012120',\n",
       " 'D012128',\n",
       " 'D012148',\n",
       " 'D012175',\n",
       " 'D012208',\n",
       " 'D012213',\n",
       " 'D012220',\n",
       " 'D012221',\n",
       " 'D012282',\n",
       " 'D012373',\n",
       " 'D012393',\n",
       " 'D012507',\n",
       " 'D012509',\n",
       " 'D012512',\n",
       " 'D012516',\n",
       " 'D012552',\n",
       " 'D012559',\n",
       " 'D012628',\n",
       " 'D012640',\n",
       " 'D012772',\n",
       " 'D012778',\n",
       " 'D012798',\n",
       " 'D012810',\n",
       " 'D012852',\n",
       " 'D012859',\n",
       " 'D012878',\n",
       " 'D012883',\n",
       " 'D012893',\n",
       " 'D013119',\n",
       " 'D013158',\n",
       " 'D013174',\n",
       " 'D013180',\n",
       " 'D013224',\n",
       " 'D013226',\n",
       " 'D013272',\n",
       " 'D013274',\n",
       " 'D013280',\n",
       " 'D013290',\n",
       " 'D013313',\n",
       " 'D013345',\n",
       " 'D013585',\n",
       " 'D013617',\n",
       " 'D013736',\n",
       " 'D013771',\n",
       " 'D013920',\n",
       " 'D013921',\n",
       " 'D013964',\n",
       " 'D013967',\n",
       " 'D013971',\n",
       " 'D013981',\n",
       " 'D014009',\n",
       " 'D014010',\n",
       " 'D014069',\n",
       " 'D014098',\n",
       " 'D014123',\n",
       " 'D014141',\n",
       " 'D014277',\n",
       " 'D014328',\n",
       " 'D014352',\n",
       " 'D014397',\n",
       " 'D014435',\n",
       " 'D014526',\n",
       " 'D014552',\n",
       " 'D014555',\n",
       " 'D014581',\n",
       " 'D014591',\n",
       " 'D014594',\n",
       " 'D014606',\n",
       " 'D014842',\n",
       " 'D014860',\n",
       " 'D014901',\n",
       " 'D014927',\n",
       " 'D015043',\n",
       " 'D015179',\n",
       " 'D015212',\n",
       " 'D015228',\n",
       " 'D015266',\n",
       " 'D015270',\n",
       " 'D015451',\n",
       " 'D015464',\n",
       " 'D015473',\n",
       " 'D015523',\n",
       " 'D015535',\n",
       " 'D015614',\n",
       " 'D015658',\n",
       " 'D015663',\n",
       " 'D015673',\n",
       " 'D015812',\n",
       " 'D015863',\n",
       " 'D016055',\n",
       " 'D016066',\n",
       " 'D016403',\n",
       " 'D016410',\n",
       " 'D016411',\n",
       " 'D016489',\n",
       " 'D016532',\n",
       " 'D016781',\n",
       " 'D016868',\n",
       " 'D016881',\n",
       " 'D016889',\n",
       " 'D016905',\n",
       " 'D016919',\n",
       " 'D017086',\n",
       " 'D017116',\n",
       " 'D017180',\n",
       " 'D017229',\n",
       " 'D017681',\n",
       " 'D017726',\n",
       " 'D018088',\n",
       " 'D018273',\n",
       " 'D018357',\n",
       " 'D018410',\n",
       " 'D018589',\n",
       " 'D018636',\n",
       " 'D018783',\n",
       " 'D018805',\n",
       " 'D019052',\n",
       " 'D019190',\n",
       " 'D019586',\n",
       " 'D019694',\n",
       " 'D019955',\n",
       " 'D019966',\n",
       " 'D020176',\n",
       " 'D020250',\n",
       " 'D020269',\n",
       " 'D020329',\n",
       " 'D020370',\n",
       " 'D020388',\n",
       " 'D020522',\n",
       " 'D020528',\n",
       " 'D020529',\n",
       " 'D020734',\n",
       " 'D020795',\n",
       " 'D020803',\n",
       " 'D020918',\n",
       " 'D021441',\n",
       " 'D029424',\n",
       " 'D031901',\n",
       " 'D034721',\n",
       " 'D043183',\n",
       " 'D046152',\n",
       " 'D054198',\n",
       " 'D054990',\n",
       " 'D055752',\n",
       " 'D055953',\n",
       " 'D056844',\n",
       " 'D061218',\n",
       " 'D065631'}"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "id_in_disease"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "disease_id_name = {}\n",
    "for line in open(\"to_neo4j/disease.tsv\"):\n",
    "    disease_id = line.strip().split(\"\\t\")[0]\n",
    "    disease_name = line.strip().split(\"\\t\")[1]\n",
    "    disease_id_name[disease_id] = disease_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [],
   "source": [
    "content = \"id\\tname\\tcategories\\n\"\n",
    "for d in id_in_disease:\n",
    "    if d in disease_categories:\n",
    "        categories = '|'.join(disease_categories[d])\n",
    "        content += f\"{d}\\t{disease_id_name[d]}\\t{categories}\\n\"\n",
    "    else:\n",
    "        content += f\"{d}\\t{disease_id_name[d]}\\t\\n\"\n",
    "\n",
    "with open(\"to_neo4j/disease_category.tsv\", \"w\") as f:\n",
    "    f.write(content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "druglink",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
